In [2]:
import pandas as pd

In [9]:
data1=pd.DataFrame({'id':[1,2,3],'a':[10,11,12],'c':[101,101,102]})
data2=pd.DataFrame({'id':[2,3,4],'b':[41,42,43],'d':[51,61,72]})

In [10]:
data1

   id   a    c
0   1  10  101
1   2  11  101
2   3  12  102

In [11]:
data2

   id   b   d
0   2  41  51
1   3  42  61
2   4  43  72

In [12]:
# All rows in data1 that have a match in data2.
data1[data1.id.isin(data2.id)]

   id   a    c
1   2  11  101
2   3  12  102

In [13]:
# All rows in data1 but not in data2
data1[~data1.id.isin(data2.id)]

   id   a    c
0   1  10  101